# GetTaggedReference Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
IndependentTag..::..GetTaggedReference Method
IndependentTag Class See Also
---
Get the host reference of the tag.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2018
# Syntax
C#
---
```text
[ObsoleteAttribute("This method is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetTaggedReferences()` method instead.")]
public Reference GetTaggedReference()
```

Visual Basic
---
```text
<ObsoleteAttribute("This method is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetTaggedReferences()` method instead.")> _
Public Function GetTaggedReference As Reference
```

Visual C++
---
```text
[ObsoleteAttribute(L"This method is deprecated in Revit 2022 and will be removed in a later version of Revit. We suggest you use the `GetTaggedReferences()` method instead.")]
public:
Reference^ GetTaggedReference()
```

# Remarks
The reference can be to an element or subelement in a local or linked document.
# See Also
IndependentTag Class
Autodesk.Revit.DB Namespace